04_OpenFoam/_Tut_02/OpenFOAM-14/incompressibleVoF/DTCHullWave/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Mesh if necessary
if ! isTest "$@" || (! cloneMesh ../DTCHull . && ! cloneMesh ../DTCHullMoving .)
then
    ./Allmesh
else
    runApplication decomposePar -noFields
fi

# Copy the fields into the processor directories
runApplication -a decomposePar -fields -copyZero

# Run
runParallel foamRun

# Reconstruct
runApplication reconstructPar

#------------------------------------------------------------------------------
